# ModelAccessValidationService Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..ModelAccessValidationService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
The external service which validates the access to Revit model such as Revit Cloud model.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId ModelAccessValidationService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ModelAccessValidationService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ ModelAccessValidationService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace